Autodesk.AutoCAD.Windows.PaletteSet.PaletteSetHostMoved
Occurs just prior to a change in position and size.

Autodesk.AutoCAD.Windows.PaletteSet.PaletteSetEnterSizeMove
Occurs after a size or move operation has completed.